app/controllers/organizations_controller.rb

SELECT "organizations".* FROM "organizations"
---
    def index
        organization = Organization.all

SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @organization = Organization.find(params[:id])