app/controllers/volunteers_controller.rb

    def create
        volunteer = Volunteer.new({username: params[:username]})
        if volunteer.valid?
            volunteer.save
---
INSERT INTO "volunteers" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "Jen"], ["created_at", "2020-01-01 03:27:49.153025"], ["updated_at", "2020-01-01 03:27:49.153025"]]

    def show
        volunteer = Volunteer.find(params[:id])
---
SELECT "volunteers".* FROM "volunteers" WHERE "volunteers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def login
        volunteer = Volunteer.find_by({username: params[:username]})
---
SELECT "volunteers".* FROM "volunteers" WHERE "volunteers"."username" = $1 LIMIT $2  [["username", "jw"], ["LIMIT", 1]]

    def destroy
        volunteer = Volunteer.find(params[:id])
        volunteer.destroy
        render json: Volunteer.all
---
SELECT "volunteers".* FROM "volunteers" WHERE "volunteers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "volunteers" WHERE "volunteers"."id" = $1  [["id", 3]]
SELECT "volunteers".* FROM "volunteers"